; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	thermograph2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Phenomenon3 - direction
	Phenomenon4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 thermograph2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon9)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 106)
	(supports instrument1 thermograph1)
	(supports instrument1 thermograph2)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 infrared0)
	(supports instrument2 thermograph1)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon4)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 194)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon3)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 174)
	(supports instrument6 thermograph1)
	(supports instrument6 infrared0)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 infrared0)
	(calibration_target instrument7 GroundStation1)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet7)
	(= (data_capacity satellite3) 1000)
	(= (fuel satellite3) 175)
	(= (data Phenomenon3 thermograph2) 96)
	(= (data Phenomenon4 thermograph2) 159)
	(= (data Phenomenon5 thermograph2) 107)
	(= (data Planet6 thermograph2) 220)
	(= (data Planet7 thermograph2) 63)
	(= (data Star8 thermograph2) 41)
	(= (data Phenomenon9 thermograph2) 2)
	(= (data Star10 thermograph2) 275)
	(= (data Planet11 thermograph2) 226)
	(= (data Phenomenon3 thermograph1) 52)
	(= (data Phenomenon4 thermograph1) 30)
	(= (data Phenomenon5 thermograph1) 288)
	(= (data Planet6 thermograph1) 88)
	(= (data Planet7 thermograph1) 248)
	(= (data Star8 thermograph1) 167)
	(= (data Phenomenon9 thermograph1) 103)
	(= (data Star10 thermograph1) 104)
	(= (data Planet11 thermograph1) 233)
	(= (data Phenomenon3 infrared0) 199)
	(= (data Phenomenon4 infrared0) 49)
	(= (data Phenomenon5 infrared0) 148)
	(= (data Planet6 infrared0) 93)
	(= (data Planet7 infrared0) 261)
	(= (data Star8 infrared0) 263)
	(= (data Phenomenon9 infrared0) 273)
	(= (data Star10 infrared0) 62)
	(= (data Planet11 infrared0) 145)
	(= (slew_time GroundStation2 Star0) 6.249)
	(= (slew_time Star0 GroundStation2) 6.249)
	(= (slew_time GroundStation2 GroundStation1) 45.35)
	(= (slew_time GroundStation1 GroundStation2) 45.35)
	(= (slew_time GroundStation1 Star0) 72.05)
	(= (slew_time Star0 GroundStation1) 72.05)
	(= (slew_time Phenomenon3 Star0) 9.997)
	(= (slew_time Star0 Phenomenon3) 9.997)
	(= (slew_time Phenomenon3 GroundStation1) 19.4)
	(= (slew_time GroundStation1 Phenomenon3) 19.4)
	(= (slew_time Phenomenon3 GroundStation2) 50.49)
	(= (slew_time GroundStation2 Phenomenon3) 50.49)
	(= (slew_time Phenomenon4 Star0) 38.01)
	(= (slew_time Star0 Phenomenon4) 38.01)
	(= (slew_time Phenomenon4 GroundStation1) 87.46)
	(= (slew_time GroundStation1 Phenomenon4) 87.46)
	(= (slew_time Phenomenon4 GroundStation2) 18.9)
	(= (slew_time GroundStation2 Phenomenon4) 18.9)
	(= (slew_time Phenomenon4 Phenomenon3) 65.13)
	(= (slew_time Phenomenon3 Phenomenon4) 65.13)
	(= (slew_time Phenomenon5 Star0) 48.22)
	(= (slew_time Star0 Phenomenon5) 48.22)
	(= (slew_time Phenomenon5 GroundStation1) 44.93)
	(= (slew_time GroundStation1 Phenomenon5) 44.93)
	(= (slew_time Phenomenon5 GroundStation2) 48.38)
	(= (slew_time GroundStation2 Phenomenon5) 48.38)
	(= (slew_time Phenomenon5 Phenomenon3) 71.07)
	(= (slew_time Phenomenon3 Phenomenon5) 71.07)
	(= (slew_time Phenomenon5 Phenomenon4) 7.18)
	(= (slew_time Phenomenon4 Phenomenon5) 7.18)
	(= (slew_time Planet6 Star0) 12.16)
	(= (slew_time Star0 Planet6) 12.16)
	(= (slew_time Planet6 GroundStation1) 65.3)
	(= (slew_time GroundStation1 Planet6) 65.3)
	(= (slew_time Planet6 GroundStation2) 22.89)
	(= (slew_time GroundStation2 Planet6) 22.89)
	(= (slew_time Planet6 Phenomenon3) 66.25)
	(= (slew_time Phenomenon3 Planet6) 66.25)
	(= (slew_time Planet6 Phenomenon4) 36.23)
	(= (slew_time Phenomenon4 Planet6) 36.23)
	(= (slew_time Planet6 Phenomenon5) 18.24)
	(= (slew_time Phenomenon5 Planet6) 18.24)
	(= (slew_time Planet7 Star0) 34.12)
	(= (slew_time Star0 Planet7) 34.12)
	(= (slew_time Planet7 GroundStation1) 55.46)
	(= (slew_time GroundStation1 Planet7) 55.46)
	(= (slew_time Planet7 GroundStation2) 33.32)
	(= (slew_time GroundStation2 Planet7) 33.32)
	(= (slew_time Planet7 Phenomenon3) 41.33)
	(= (slew_time Phenomenon3 Planet7) 41.33)
	(= (slew_time Planet7 Phenomenon4) 83.47)
	(= (slew_time Phenomenon4 Planet7) 83.47)
	(= (slew_time Planet7 Phenomenon5) 53.25)
	(= (slew_time Phenomenon5 Planet7) 53.25)
	(= (slew_time Planet7 Planet6) 6.879)
	(= (slew_time Planet6 Planet7) 6.879)
	(= (slew_time Star8 Star0) 33.56)
	(= (slew_time Star0 Star8) 33.56)
	(= (slew_time Star8 GroundStation1) 16.81)
	(= (slew_time GroundStation1 Star8) 16.81)
	(= (slew_time Star8 GroundStation2) 36.45)
	(= (slew_time GroundStation2 Star8) 36.45)
	(= (slew_time Star8 Phenomenon3) 21.55)
	(= (slew_time Phenomenon3 Star8) 21.55)
	(= (slew_time Star8 Phenomenon4) 67.46)
	(= (slew_time Phenomenon4 Star8) 67.46)
	(= (slew_time Star8 Phenomenon5) 3.862)
	(= (slew_time Phenomenon5 Star8) 3.862)
	(= (slew_time Star8 Planet6) 30.36)
	(= (slew_time Planet6 Star8) 30.36)
	(= (slew_time Star8 Planet7) 14.08)
	(= (slew_time Planet7 Star8) 14.08)
	(= (slew_time Phenomenon9 Star0) 58.22)
	(= (slew_time Star0 Phenomenon9) 58.22)
	(= (slew_time Phenomenon9 GroundStation1) 42.21)
	(= (slew_time GroundStation1 Phenomenon9) 42.21)
	(= (slew_time Phenomenon9 GroundStation2) 48.23)
	(= (slew_time GroundStation2 Phenomenon9) 48.23)
	(= (slew_time Phenomenon9 Phenomenon3) 31.12)
	(= (slew_time Phenomenon3 Phenomenon9) 31.12)
	(= (slew_time Phenomenon9 Phenomenon4) 4.463)
	(= (slew_time Phenomenon4 Phenomenon9) 4.463)
	(= (slew_time Phenomenon9 Phenomenon5) 60.8)
	(= (slew_time Phenomenon5 Phenomenon9) 60.8)
	(= (slew_time Phenomenon9 Planet6) 14.84)
	(= (slew_time Planet6 Phenomenon9) 14.84)
	(= (slew_time Phenomenon9 Planet7) 63.09)
	(= (slew_time Planet7 Phenomenon9) 63.09)
	(= (slew_time Phenomenon9 Star8) 17.91)
	(= (slew_time Star8 Phenomenon9) 17.91)
	(= (slew_time Star10 Star0) 35.24)
	(= (slew_time Star0 Star10) 35.24)
	(= (slew_time Star10 GroundStation1) 64.86)
	(= (slew_time GroundStation1 Star10) 64.86)
	(= (slew_time Star10 GroundStation2) 84.15)
	(= (slew_time GroundStation2 Star10) 84.15)
	(= (slew_time Star10 Phenomenon3) 25.52)
	(= (slew_time Phenomenon3 Star10) 25.52)
	(= (slew_time Star10 Phenomenon4) 12.76)
	(= (slew_time Phenomenon4 Star10) 12.76)
	(= (slew_time Star10 Phenomenon5) 42.68)
	(= (slew_time Phenomenon5 Star10) 42.68)
	(= (slew_time Star10 Planet6) 1.686)
	(= (slew_time Planet6 Star10) 1.686)
	(= (slew_time Star10 Planet7) 29.73)
	(= (slew_time Planet7 Star10) 29.73)
	(= (slew_time Star10 Star8) 4.273)
	(= (slew_time Star8 Star10) 4.273)
	(= (slew_time Star10 Phenomenon9) 35.56)
	(= (slew_time Phenomenon9 Star10) 35.56)
	(= (slew_time Planet11 Star0) 10.36)
	(= (slew_time Star0 Planet11) 10.36)
	(= (slew_time Planet11 GroundStation1) 10.43)
	(= (slew_time GroundStation1 Planet11) 10.43)
	(= (slew_time Planet11 GroundStation2) 65.17)
	(= (slew_time GroundStation2 Planet11) 65.17)
	(= (slew_time Planet11 Phenomenon3) 53.05)
	(= (slew_time Phenomenon3 Planet11) 53.05)
	(= (slew_time Planet11 Phenomenon4) 36.78)
	(= (slew_time Phenomenon4 Planet11) 36.78)
	(= (slew_time Planet11 Phenomenon5) 27.65)
	(= (slew_time Phenomenon5 Planet11) 27.65)
	(= (slew_time Planet11 Planet6) 14.69)
	(= (slew_time Planet6 Planet11) 14.69)
	(= (slew_time Planet11 Planet7) 73.91)
	(= (slew_time Planet7 Planet11) 73.91)
	(= (slew_time Planet11 Star8) 37.86)
	(= (slew_time Star8 Planet11) 37.86)
	(= (slew_time Planet11 Phenomenon9) 40.3)
	(= (slew_time Phenomenon9 Planet11) 40.3)
	(= (slew_time Planet11 Star10) 43.26)
	(= (slew_time Star10 Planet11) 43.26)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Phenomenon5)
	(pointing satellite3 Star0)
	(have_image Phenomenon3 thermograph2)
	(have_image Phenomenon4 infrared0)
	(have_image Phenomenon5 thermograph1)
	(have_image Planet6 thermograph2)
	(have_image Planet7 infrared0)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 thermograph1)
	(have_image Star10 infrared0)
	(have_image Planet11 thermograph1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 star8 phenomenon3)
   deleted: (pointing satellite2 phenomenon3)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 174 to 152.45, (fuel-used) from 0 to 21.55
   goals met: 0 of 11
2. (turn_to satellite3 star0 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star0)
   changed: (fuel satellite3) from 175 to 140.88, (fuel-used) from 21.55 to 55.67
   goals met: 1 of 11
3. (turn_to satellite2 planet6 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 152.45 to 122.09, (fuel-used) from 55.67 to 86.03
   goals met: 1 of 11
4. (turn_to satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 122.09 to 120.404, (fuel-used) from 86.03 to 87.716
   goals met: 1 of 11
5. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 120.404 to 116.131, (fuel-used) from 87.716 to 91.989
   goals met: 1 of 11
6. (turn_to satellite2 star10 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 116.131 to 111.858, (fuel-used) from 91.989 to 96.262
   goals met: 1 of 11
7. (turn_to satellite2 planet6 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 111.858 to 110.172, (fuel-used) from 96.262 to 97.948
   goals met: 1 of 11
8. (turn_to satellite2 star8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 110.172 to 79.812, (fuel-used) from 97.948 to 128.308
   goals met: 1 of 11
9. (turn_to satellite2 star10 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 79.812 to 75.539, (fuel-used) from 128.308 to 132.581
   goals met: 1 of 11
10. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 75.539 to 71.266, (fuel-used) from 132.581 to 136.854
   goals met: 1 of 11
11. (turn_to satellite2 planet6 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 71.266 to 40.906, (fuel-used) from 136.854 to 167.214
   goals met: 1 of 11
12. (turn_to satellite2 star0 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star0)
   changed: (fuel satellite2) from 40.906 to 28.746, (fuel-used) from 167.214 to 179.374
   goals met: 1 of 11
13. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 194 to 189.537, (fuel-used) from 179.374 to 183.837
   goals met: 1 of 11
14. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 189.537 to 185.074, (fuel-used) from 183.837 to 188.3
   goals met: 1 of 11
15. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 185.074 to 180.611, (fuel-used) from 188.3 to 192.763
   goals met: 1 of 11
16. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 180.611 to 176.148, (fuel-used) from 192.763 to 197.226
   goals met: 1 of 11
17. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 176.148 to 171.685, (fuel-used) from 197.226 to 201.689
   goals met: 1 of 11
18. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 171.685 to 167.222, (fuel-used) from 201.689 to 206.152
   goals met: 1 of 11
19. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 167.222 to 162.759, (fuel-used) from 206.152 to 210.615
   goals met: 1 of 11
20. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 162.759 to 158.296, (fuel-used) from 210.615 to 215.078
   goals met: 1 of 11
21. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 158.296 to 153.833, (fuel-used) from 215.078 to 219.541
   goals met: 1 of 11
22. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 153.833 to 149.37, (fuel-used) from 219.541 to 224.004
   goals met: 1 of 11
23. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 1 of 11
24. (turn_to satellite1 groundstation2 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 149.37 to 130.47, (fuel-used) from 224.004 to 242.904
   goals met: 1 of 11
25. (turn_to satellite1 phenomenon9 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 130.47 to 82.24, (fuel-used) from 242.904 to 291.134
   goals met: 1 of 11
26. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 11
27. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 11
28. (turn_to satellite1 groundstation2 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 82.24 to 34.01, (fuel-used) from 291.134 to 339.364
   goals met: 1 of 11
29. (turn_to satellite2 planet6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 planet6)
   changed: (fuel satellite2) from 28.746 to 16.586, (fuel-used) from 339.364 to 351.524
   goals met: 1 of 11
30. (turn_to satellite1 star0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 34.01 to 27.761, (fuel-used) from 351.524 to 357.773
   goals met: 1 of 11
31. (turn_to satellite2 star10 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 star10)
   changed: (fuel satellite2) from 16.586 to 14.9, (fuel-used) from 357.773 to 359.459
   goals met: 1 of 11
32. (turn_to satellite2 star8 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 14.9 to 10.627, (fuel-used) from 359.459 to 363.732
   goals met: 1 of 11
33. (turn_to satellite1 groundstation2 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation2)
   changed: (fuel satellite1) from 27.761 to 21.512, (fuel-used) from 363.732 to 369.981
   goals met: 1 of 11
34. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 1 of 11
35. (turn_to satellite1 star0 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star0)
   changed: (fuel satellite1) from 21.512 to 15.263, (fuel-used) from 369.981 to 376.23
   goals met: 1 of 11
36. (switch_off instrument2 satellite1)
   deleted: (power_on instrument2)
   added: (power_avail satellite1)
   goals met: 1 of 11
37. (turn_to satellite1 phenomenon3 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 phenomenon3)
   changed: (fuel satellite1) from 15.263 to 5.266, (fuel-used) from 376.23 to 386.227
   goals met: 1 of 11
38. (turn_to satellite3 planet11 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 140.88 to 130.52, (fuel-used) from 386.227 to 396.587
   goals met: 0 of 11
39. (turn_to satellite3 groundstation1 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 130.52 to 120.09, (fuel-used) from 396.587 to 407.017
   goals met: 0 of 11
40. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 120.09 to 109.66, (fuel-used) from 407.017 to 417.447
   goals met: 0 of 11
41. (turn_to satellite3 groundstation1 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 groundstation1)
   changed: (fuel satellite3) from 109.66 to 99.23, (fuel-used) from 417.447 to 427.877
   goals met: 0 of 11
42. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 11
43. (calibrate satellite3 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 0 of 11
44. (turn_to satellite3 planet11 groundstation1)
   deleted: (pointing satellite3 groundstation1)
   added: (pointing satellite3 planet11)
   changed: (fuel satellite3) from 99.23 to 88.8, (fuel-used) from 427.877 to 438.307
   goals met: 0 of 11
45. (take_image satellite3 planet11 instrument6 thermograph1)
   added: (have_image planet11 thermograph1)
   changed: (data_capacity satellite3) from 1000 to 767, (data-stored) from 0 to 233
   goals met: 1 of 11
46. (turn_to satellite3 star0 planet11)
   deleted: (pointing satellite3 planet11)
   added: (pointing satellite3 star0)
   changed: (fuel satellite3) from 88.8 to 78.44, (fuel-used) from 438.307 to 448.667
   goals met: 2 of 11
47. (turn_to satellite2 phenomenon5 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 10.627 to 6.765, (fuel-used) from 448.667 to 452.529
   goals met: 3 of 11
48. (turn_to satellite3 planet6 star0)
   deleted: (pointing satellite3 star0)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 78.44 to 66.28, (fuel-used) from 452.529 to 464.689
   goals met: 2 of 11
49. (turn_to satellite3 star10 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 66.28 to 64.594, (fuel-used) from 464.689 to 466.375
   goals met: 2 of 11
50. (turn_to satellite3 planet6 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 64.594 to 62.908, (fuel-used) from 466.375 to 468.061
   goals met: 2 of 11
51. (turn_to satellite3 star10 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 62.908 to 61.222, (fuel-used) from 468.061 to 469.747
   goals met: 2 of 11
52. (turn_to satellite3 planet6 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 61.222 to 59.536, (fuel-used) from 469.747 to 471.433
   goals met: 2 of 11
53. (turn_to satellite3 star10 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 59.536 to 57.85, (fuel-used) from 471.433 to 473.119
   goals met: 2 of 11
54. (take_image satellite3 star10 instrument6 infrared0)
   added: (have_image star10 infrared0)
   changed: (data_capacity satellite3) from 767 to 705, (data-stored) from 233 to 295
   goals met: 3 of 11
55. (turn_to satellite3 planet6 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 57.85 to 56.164, (fuel-used) from 473.119 to 474.805
   goals met: 3 of 11
56. (turn_to satellite3 planet7 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 planet7)
   changed: (fuel satellite3) from 56.164 to 49.285, (fuel-used) from 474.805 to 481.684
   goals met: 3 of 11
57. (take_image satellite3 planet7 instrument6 infrared0)
   added: (have_image planet7 infrared0)
   changed: (data_capacity satellite3) from 705 to 444, (data-stored) from 295 to 556
   goals met: 4 of 11
58. (turn_to satellite3 planet6 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 planet6)
   changed: (fuel satellite3) from 49.285 to 42.406, (fuel-used) from 481.684 to 488.563
   goals met: 4 of 11
59. (turn_to satellite3 star10 planet6)
   deleted: (pointing satellite3 planet6)
   added: (pointing satellite3 star10)
   changed: (fuel satellite3) from 42.406 to 40.72, (fuel-used) from 488.563 to 490.249
   goals met: 4 of 11
60. (turn_to satellite3 phenomenon4 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 phenomenon4)
   changed: (fuel satellite3) from 40.72 to 27.96, (fuel-used) from 490.249 to 503.009
   goals met: 4 of 11
61. (take_image satellite3 phenomenon4 instrument6 infrared0)
   added: (have_image phenomenon4 infrared0)
   changed: (data_capacity satellite3) from 444 to 395, (data-stored) from 556 to 605
   goals met: 5 of 11
62. (turn_to satellite3 groundstation2 phenomenon4)
   deleted: (pointing satellite3 phenomenon4)
   added: (pointing satellite3 groundstation2)
   changed: (fuel satellite3) from 27.96 to 9.06, (fuel-used) from 503.009 to 521.909
   goals met: 5 of 11
63. (turn_to satellite3 star0 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 star0)
   changed: (fuel satellite3) from 9.06 to 2.811, (fuel-used) from 521.909 to 528.158
   goals met: 6 of 11
64. (turn_to satellite0 star8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 106 to 88.09, (fuel-used) from 528.158 to 546.068
   goals met: 6 of 11
65. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 11
66. (turn_to satellite0 groundstation1 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 groundstation1)
   changed: (fuel satellite0) from 88.09 to 71.28, (fuel-used) from 546.068 to 562.878
   goals met: 6 of 11
67. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 6 of 11
68. (turn_to satellite0 star8 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 71.28 to 54.47, (fuel-used) from 562.878 to 579.688
   goals met: 6 of 11
69. (take_image satellite0 star8 instrument0 thermograph1)
   added: (have_image star8 thermograph1)
   changed: (data_capacity satellite0) from 1000 to 833, (data-stored) from 605 to 772
   goals met: 7 of 11
70. (turn_to satellite0 star10 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star10)
   changed: (fuel satellite0) from 54.47 to 50.197, (fuel-used) from 579.688 to 583.961
   goals met: 7 of 11
71. (turn_to satellite0 planet6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet6)
   changed: (fuel satellite0) from 50.197 to 48.511, (fuel-used) from 583.961 to 585.647
   goals met: 7 of 11
72. (take_image satellite0 planet6 instrument0 thermograph2)
   added: (have_image planet6 thermograph2)
   changed: (data_capacity satellite0) from 833 to 613, (data-stored) from 772 to 992
   goals met: 8 of 11
73. (turn_to satellite0 phenomenon9 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 48.511 to 33.671, (fuel-used) from 585.647 to 600.487
   goals met: 8 of 11
74. (take_image satellite0 phenomenon9 instrument0 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   changed: (data_capacity satellite0) from 613 to 510, (data-stored) from 992 to 1095
   goals met: 9 of 11
75. (take_image satellite2 phenomenon5 instrument4 thermograph1)
   added: (have_image phenomenon5 thermograph1)
   changed: (data_capacity satellite2) from 1000 to 712, (data-stored) from 1095 to 1383
   goals met: 10 of 11
76. (switch_on instrument2 satellite1)
   deleted: (calibrated instrument2) (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 10 of 11
77. (turn_to satellite0 phenomenon3 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon3)
   changed: (fuel satellite0) from 33.671 to 2.551, (fuel-used) from 600.487 to 631.607
   goals met: 10 of 11
78. (take_image satellite0 phenomenon3 instrument0 thermograph2)
   added: (have_image phenomenon3 thermograph2)
   changed: (data_capacity satellite0) from 510 to 414, (data-stored) from 1383 to 1479
   goals met: 11 of 11
